In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
from datetime import datetime
%matplotlib inline

#### Reading Data

In [66]:
df = pd.read_stata("data/5pct_sample_2019_10.dta")
db_date = pd.read_csv("data/db_date.csv")

In [67]:
new_df = df.merge(db_date, on = 'date')

In [68]:
df1 = np.where(new_df['item'] == 250)
df1 = new_df.loc[df1]

In [69]:
ts = df1[['date2','price','region']]
ts.head()

           date2  price       region
141   01-12-2014   0.45       London
696   01-12-2014   0.49   South East
1726  01-12-2014   0.75  East Anglia
1727  01-12-2014   0.99  East Anglia
1728  01-12-2014   0.49  East Anglia

In [70]:
ts.rename(columns={'date2':'date'},inplace = True)

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\frame.py:5039: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().rename(

In [71]:
ts['date'] = pd.to_datetime(ts["date"],format="%d-%m-%Y")

C:\Users\ColCelCo\AppData\Local\Temp/ipykernel_32660/2922480741.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ts['date'] = pd.to_datetime(ts["date"],format="%d-%m-%Y")

#### Data Cleaning

In [21]:
#setting the date column as our new index
#ts.set_index("date",inplace = True)

In [72]:
ts.head()

           date  price       region
141  2014-12-01   0.45       London
696  2014-12-01   0.49   South East
1726 2014-12-01   0.75  East Anglia
1727 2014-12-01   0.99  East Anglia
1728 2014-12-01   0.49  East Anglia

In [73]:
#Removing duplicates
ts.drop_duplicates(keep = "first",inplace = True)

C:\ProgramData\Anaconda3\lib\site-packages\pandas\util\_decorators.py:311: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return func(*args, **kwargs)

In [74]:
ts.duplicated().sum()

0

In [75]:
ts.shape

(4159, 3)

In [76]:
ts

              date  price         region
141     2014-12-01   0.45         London
696     2014-12-01   0.49     South East
1726    2014-12-01   0.75    East Anglia
1727    2014-12-01   0.99    East Anglia
1728    2014-12-01   0.49    East Anglia
...            ...    ...            ...
1768950 1993-12-01   0.45  West Midlands
1769795 1993-12-01   0.49     North West
1770287 1993-12-01   0.49          North
1770684 1993-12-01   0.39          Wales
1770984 1993-12-01   0.35       Scotland

[4159 rows x 3 columns]

In [77]:
list(ts['region'].unique())

['London',
 'South East',
 'East Anglia',
 'East Midlands',
 'Yorkshire & Humber',
 'North',
 'Wales',
 'Scotland',
 'North West',
 'South West',
 'West Midlands',
 'Northern Ireland',
 99]

In [78]:
ts1 = np.where(ts['region'] == 'London')
ts1 = ts.iloc[ts1]
# ts_1 =  ts1.pivot(columns="region", values="price")
# ts_1.head()

In [79]:
ts1.shape

(447, 3)

In [80]:
ts1['date'].drop_duplicates(keep = 'first',inplace = True)

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\series.py:2136: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._update_inplace(result)

In [65]:
ts1.shape

(447, 3)

In [83]:
ts1['date'].duplicated().sum()

182

In [84]:
ts2 = ts1.groupby('date').mean()